"""
Домашнє завдання: Основи Python

**1.** Створіть три змінні з правильними іменами (англійською мовою): 
одну для збереження віку, 
одну для імені студента, 
одну для позначення чи є особа студентом. 
Додайте коментарі до кожної змінної.
"""
# код вводити тут
age = None              # оголошення змінної, якій присвоюється значення - вік (значення None, враховуючи що наразі значення немає)
student_name = None     # оголошення змінної, якій присвоюється значення - ім'я студента (значення None, враховуючи що наразі значення немає) 
student_or_not = True   # оголошення булевої змінної, якій присвоюється значення - чи є особа студентом чи ні 
"""

**2.** Рзкоментуйте та виправте помилки в наступних назвах змінних.
Поясніть у коментарях, чому початкові назви неправильні:
"""
student_name = "John"     # з імені змінної незрозуміло її призначення з цифрою 2, та чиє ім'я визначено
user_age = 25             # в імені змінної не можна використовувати спеціальний символ (-)
price_apple = 100         # в імені змінної не можна використовувати спеціальний символ ($), та незрозуміло ціна чого визначається
school_subject = "Math"  # в імені не можна використовувати слова зарезервовані пайтоном (class) та незрозуміло значення "Math" що визначає  
"""
**3.** Створіть змінну з описовим ім'ям для збереження максимальної кількості студентів у групі. 
Присвойте їй значення 30.
"""
# код вводити тут
students_max_number_group = 30
"""
**4.** Створіть змінні для збереження: 
назви курсу, 
кількості годин, 
вартості курсу. 
Використайте правильне іменування змінних.
"""
# код вводити тут
course_name = None
course_total_study_hours = None
course_price = None
"""
**5.** Розрхуйте та виведіть Затрати курсу: 
Затрати курсу  = кількість годин / вартість курсу
Використайте правильне іменування змінних.
"""
# код вводити тут
price_one_hour_course = course_total_study_hours / course_price
print("price_one_hour_course")
"""
**6.** Створіть змінні з різними способами запису чисел:
- Десяткове число: 42
- Двійкове число: 101010 (в двійковій системі)
- Шістнадцяткове число: 2A (в шістнадцятковій системі)
- Восьмеричне число: 52 (в восьмеричній системі)
"""
# код вводити тут
decimal_number = int(42)
binary_number = bin(42)
hexadecimal_number = hex(42)
octal_number = oct(52)
"""
**7.** Виконайте всі арифметичні операції (+, -, *, /, //, %, **) з числами 17 та 5. 
Виведіть результати з поясненнями.
"""
# код вводити тут
a = 17
b = 5
addition = a + b              
subtraction = a - b           
multiplication =  a * b       
division = a / b              
integer_division = a // b     
percentage = a % b            
exponent = a ** b             
print("Повертає результат додавання двох чисел 17 та 5 - ",addition, '\n',
      "Повертає результат віднімання двох чисел 17 та 5 - ",subtraction,'\n',
      "Повертає результат множення двох чисел 17 та 5 - ",multiplication, '\n',
      "Повертає результат ділення двох чисел 17 та 5 - ",division, '\n',
      "Повертає результат ділення чисел 17 та 5 з округленням до меньшого - ",integer_division, '\n',
      "Повертає результат целочисленного остатку від ділення чисел 17 та 5 - ",percentage, '\n',
      "Повертає результат зведення числа 17 в ступінь 5 - ",exponent, sep = '')
"""
**8.** Обчисліть площу кола з радіусом 7.5. Використайте значення π = 3.14159.
"""
# код вводити тут
number_pi = 3.14159
area_circle = number_pi * (7.5**2)
print("Площа кола с радіусом 7,5 дорівнює",area_circle)
"""
**9.** Обчисліть залишок від ділення будь-якого числа на 7. 
Виведіть результат з числами 50, 33, 14.
"""
# код вводити тут
number1 = 50
number2 = 33
number3 = 14
number4 = 7
remainder_division1 = number1 % number4
remainder_division2 = number2 % number4
remainder_division3 = number3 % number4
print("Остаток від ділення на 7 чисел 50,33,14 відповідно дорівнює",remainder_division1,
      remainder_division2,remainder_division3)
"""
**10.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""
# код вводити тут
Blacksea_area = 436402
Azovsea_area = 37800
total_area = Blacksea_area + Azovsea_area
print("Площа Чорного моря становить", f"{Blacksea_area:,}".replace(',',' '), "км2, а площа \
Азовського моря становить", f"{Azovsea_area:,}".replace(',',' '), "км2, \nшляхом додавання, "\
"загальна площа двох морів складає", f"{total_area:,}".replace(',',' '), "км2.")
"""
**11.** Створіть рядок з вашим повним ім'ям та виведіть:
- Перший символ
- Останній символ  
- Довжину рядка
"""
# код вводити тут
my_name = "Димитрій"
first_letter = my_name[0]
last_letter = my_name[7]
length = len(my_name)
print("Перший символ",first_letter,'\n' "Останній символ",last_letter, 
      '\n' "Довжина рядка",length, "символів")
"""
**12.** Створіть рядок "Would you tell me, please, which way I ought to go from here?" 
та отримайте з нього підстрічки:
- Перші 6 символів
- Останні 11 символів
"""
# код вводити тут
symbols = "Would you tell me, please, which way I ought to go from here?"
first_letters = symbols[0:6]
leight = len(symbols)
eleven_symbols = leight - 11
last_letters = symbols[eleven_symbols:leight]
print("Перші 6 символів -",first_letters,'\n' "Останні 11 символів - ",last_letters)
"""
**13.** Створіть багаторядковий рядок (використовуючи потрійні лапки) зі своїм улюбленим віршем або цитатою.
"""
# код вводити тут
poem = '''Реве та стогне Дніпр широкий
Сердитий вітер завива,
Додолу верби гне високі, 
Горами хвилю підійма
'''
print(poem)
"""
**14.** Поєднайте два рядки "Hello" та "World" у різні способи (з пробілом, з комою, з новим рядком).
"""
# код вводити тут
main_string_1 = "Hello"
main_string_2 = "World"
new_string = "of the Python"
joined_space = ' '.join([main_string_1, main_string_2])
joined_coma = ', '.join([main_string_1, main_string_2])
joined_new_string = ' '.join([main_string_1, main_string_2, new_string])
print("Поєднані рядки пробілом:", joined_space)
print("Поєднані рядки комою:", joined_coma)
print("Поєднані рядки з новим рядком:", joined_new_string)

"""
**15.** Створіть рядок з символами, які потребують екранування (лапки, зворотна коса риска).
"""
# код вводити тут
tring_with_ekran = "Викладач сказав \"знак ділення позначається символом - \\\""
print(string_with_ekran)
"""
**16.** Напишіть код, який запитує у користувача його ім'я та вік, 
а потім виводить привітання у форматі: "Привіт, [ім'я]! Тобі [вік] років."
"""
# код вводити тут
user_name = "Ваше ім'я? "
name = input(user_name)
user_age = "Скільки Вам років? "
age = input(user_age)
print("Привіт,",name,"! Тобі", age, "років.")
"""

**17.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
# код вводити тут
sum_all_foto = 232
sum_foto_one_list = 8
sum_list_fotoalbum = int(sum_all_foto / sum_foto_one_list)
print("Ігор займається фотографією. Він вирішив зібрати всі свої", sum_all_foto, \
    "фотографії та вклеїти в альбом. На одній \nсторінці може бути \
    розміщено щонайбільше", sum_foto_one_list, "фото. Щоб отримати кількість сторінок \
    для всіх фотографій, \nділимо кількість фото на кількість \
    фото розміщених на одній сторінці і отримуємо", sum_list_fotoalbum, "сторінок.")

"""
**18.** Напишіть код який запитує у користувача 
його улюблений колір та число, а потім створює персоналізоване
повідомлення використовуючи f-string форматування.
"""
# код вводити тут
favorite_color = input("Який твій улюблений колір?")
favorite_number = input("Яке твое улюблене число?")
print(f'Твій улюблений колір: {favorite_color} \nТвое улюблене число: {favorite_number}')

"""
**19.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""
# код вводити тут
total_goods = 375_291  
storage_1_and_2 = 250_449
storage_2_and_3 = 222_950
storage_1 = total_goods - storage_2_and_3
storage_3 = total_goods - storage_1_and_2
storage_2 = total_goods - storage_1 - storage_3
print("Мережа супермаркетів має 3 склади, де всього розміщено", \
f"{total_goods:,}".replace(',',' '), "товар. На першому та другому складах \nперебуває", \
f"{storage_1_and_2:,}".replace(',',' '), "товарів. На другому та третьому –", \
f"{storage_2_and_3:,}".replace(',',' '), "товарів. Для підрахування \
кількості \nтовару на кожному складі віднімаємо від загальної кількості \
товару кількість товару на першому і другому \nскладі і отримуємо кількість \
на третьому складі", f"{storage_3:,}".replace(',',' '),"товару. Кількість товару на першому \
складі \nотримуємо шляхом віднімання від загальної кількості товару кількість на другому \
та третьому складах \nі отримуємо", f"{storage_1:,}".replace(',',' '), "товару. Кількість на  \
другому складі це різниця між загальною кількістю товару, \nтовару на першому складі, \
другому складі і становить", f"{storage_2:,}".replace(',',' '), "товару.")

"""
**20.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""
# код вводити тут
total_month = 18  
month_pay = 1179
price_comp = total_month * month_pay
print("Михайло разом з батьками вирішили купити комп’ютер, скориставшись послугою \
«Оплата частинами». \nЇЇ строк становить", total_month, "місяців. Сплачувати необхідно \
буде по 1179 грн/місяць. Отже остаточна ціна \nобчислюється шляхом перемноження \
кількості місяців на виплати за місяць і складає", f"{price_comp:,}".replace(',',' '), "грн.")