# task 01 == Виправте синтаксичні помилки
print("Hello world!")


# task 02  == Виправте назви змінних, щоб текст виводався
hello = "Hello"
world = "world"
print(f"{hello} {world}!")


# task 03 == Зробіть так, щоб кількість бананів була
# завжди на чотири штуки більша, ніж яблук
apples = 2
banana = apples + 4 # код тут


# task 04 == виправте назви змінних
storona_1 = 1
storona_2 = 2
storona_3 = 3
storona_4 = 4

# task 05 == Порахуйте периметр фігури з task 04
# та виведіть його для користувача
perimetery = storona_1 + storona_2 + storona_3 + storona_4
print("perimetery")


"""
    # Задачі 06 -10:
    # Переведіть задачі з книги "Математика, 2 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в другому класі
"""
#Враховуючи що завдання передбачає перевід задач на мову пайтон  
#та вивод відповіді щоб було зрозуміло дитині з 2 класу,
#виведено відповіді з зрозумілими поясненням арифмітичних дій


# task 06
"""
У Оксани було 20 марок із серії «Мистецтво» 
і 7 марок із серії «Звірі».
5 марок із серії «Мистецтво» та
1 марку із серії «Звірі» вона подарувала подружці. 
Скільки марок лишилось у Оксани?
"""
stamps_art = 20
stamps_animals = 7
present_art = 5
present_animals = 1
less_art = stamps_art - present_art
less_animals = stamps_animals - present_animals
print("У Оксани було ", stamps_art, "марок із серії <Мистецтво> і ", 
stamps_animals, "із серії <Звірі>." "\n" "Оксана подружці подарувала", present_art, "марок серії "
"<Мистецтво> та", present_animals, "серії <Звірі>." "\n" "Якщо відняти подаровані подружці марки, " \
"тоді у Оксани залишилось", less_art, "марок із серії <Мистецтво> і", less_animals, "із серії <Звірі>")


# task 07
"""
У саду посадили 4 яблуні. Груш на 5 більше яблунь, а слив - на 2 менше.
Скільки всього дерев посадили в саду?
"""

tree_apple = 4
tree_pear = tree_apple + 5
tree_plum = tree_apple - 2
tree_sum = tree_apple + tree_pear + tree_plum
print("У саду посадили", tree_apple, "яблуні. Груш на 5 більше яблунь, тобто", "\n"
"за результатом додавання кількість посаджених груш склала", tree_pear, "а слив на 2 дерева", "\n"
"менше ніж яблунь, за результатом віднімання кількість слив склала", tree_plum, "дерева."
" Всього висадили в саду", tree_sum, "дерев.")


# task 08
"""
До обіда температура повітря була на 5 градусів вище нуля.
Після обіду температура опустилася на 10 градусів.
Надвечір потепліло на 4 градуси. Яка температура надвечір?
"""

temp_before_dinner = 0 + 5
temp_after_dinner = temp_before_dinner - 10
temp_evening = temp_after_dinner + 4
print ("До обіда температура повітря була на 5 градусів вище нуля, шляхом", "\n"
"додавання температура до обіда склала", temp_before_dinner, "градусів. Після обіду температура", "\n" 
"опустилася на 10 градусів, від температури до обіду віднімаємо 10 градусів та отримуємо", "\n" 
"температуру", temp_after_dinner, "градусів.", "Надвечір потепліло на 4 градуси, отже отримуємо остаточну", "\n" 
"температуру повітря", temp_evening,"градус.")

# task 09
"""
Взагалі у театральному гуртку - 24 хлопчики, а дівчаток - вдвічі менше.
1 хлопчик захворів та 2 дівчинки не прийшли сьогодні.
Скількі сьогодні дітей у театральному гуртку?
"""

boys = 24
girls = int(boys / 2)
today_boys = boys - 1
today_girls = girls - 2
total_boys_girls = today_boys + today_girls
print("В театральному гуртку було", boys, "хлопчики та дівчат вдвічі менше хлопчиків,", "\n"
"а саме", girls, "дівчаток. ", "Один хлопчик захворів а дві дівчинки не прийшли, віднімючи цю кількість", "\n"
"отримаємо кількість хлопчиків", today_boys, "і", today_girls, "дівчаток.", "\n"
"Тоді загальна кількість дітей в гуртку становить", total_boys_girls, "особи.")

# task 10
"""
Перша книжка коштує 8 грн., друга - на 2 грн. дороже,
а третя - як половина вартості першої та другої разом.
Скільки будуть коштувати усі книги, якщо купити по одному примірнику?
"""
book_1 = 8
book_2 = book_1 + 2
book_3 = int((book_1 + book_2) / 2)
book_price_sum = book_1 + book_2 + book_3
print("Перша книжка коштує", book_1,"грн. друга книга на 2 грн дорожче," , "\n" 
"додаємо 2 грн. до ціни першої і отримуємо", book_2, "грн. Ціна третьої книги половина суми", "\n"
"перших двох книжок і становить", book_3,"грн. В результаті сума всіх трьох книжок по одному", "\n"
"примірнику складає", book_price_sum, "грн.")